Page({

  /**
   * 页面的初始数据
   */
  data: {
    title: '隐私政策',
    listBody: '本政策适用于爱保科技（横琴）有限公司（以下简称“本公司”）微信公众号、微信小程序等网络运营平台为用户所提供的网络技术支持辅助服务以及其他增值服务（以下统称“我们的服务”），包括但不限于产品查询、产品推广、提现奖励等。\n' +
      '本政策将帮助您了解以下内容： \n' +
      '1、我们如何收集和使用您的个人信息 \n' +
      '2、我们如何使用 Cookie 和同类技术 \n' +
      '3、我们如何保护您的个人信息 \n' +
      '4、本政策如何更新\n' +
      '5、如何联系我们\n' +
      '我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。 \n' +
      '请在使用我们的产品与/或服务前，仔细阅读并了解本《隐私政策》。我们努力用通俗易懂、简明扼要的文字表达，并对本政策中与您的权益有重大关系的条款，采用粗体字进行标注，以提示您注意。\n' +
      '\n' +
      '一、我们如何收集和使用您的个人信息\n' +
      '本隐私政策中涉及的个人信息包括：基本信息、个人身份信息、网络身份标识信息、个人教育工作信息、个人财产信息、联系人信息、个人上网记录、个人常用设备信息、个人位置信息。\n' +
      '您提供的上述信息，将在您使用本服务期间持续授权我们使用。我们将在法律法规和监管规定要求的时限内保留您的上述信息。在您注销账号时，除非法律法规另有规定，我们将停止使用并删除上述信息。\n' +
      '我们的产品与/或服务包括核心业务功能和附加业务功能。我们仅会出于本政策所述的以下目的，收集和使用您的个人信息：\n' +
      '    （一）您使用我们的核心业务功能须授权我们收集和使用您个人信息的情形\n' +
      '我们的产品与/或服务包括一些核心功能，这些功能包含了产品查询、产品推广、提现奖励等所必须的功能、改进我们的产品与/或服务所必须的功能及保障交易安全所必须的功能。我们可能会收集、保存和使用下列与您有关的信息才能实现上述这些功能。如果您不提供相关信息，您将无法享受我们提供的核心业务功能。\n' +
      '（二）您可选择是否授权我们收集和使用您的个人信息的情形\n' +
      '1、为给您提供更丰富更便捷的服务，从而提升您在爱保科技的服务体验，我们的附加功能，诸如个人定制服务、积分兑换、违章查询中可能会收集和使用您的个人信息。如果您不提供这些个人信息，您依然可以使用我们的核心功能，但您可能无法使用这些可以为您带来便捷服务的相关功能。\n' +
      '2、我们从第三方获得您个人信息的情形\n' +
      '（1）我们可能从第三方获取您授权共享的账户信息（头像、昵称），并在您同意本隐私政策后将将依据与第三方的约定、对个人信息来源的合法性进行确认后，在符合相关法律和法规规定的前提下，使用您的这些个人信息。\n' +
      '（2）为向您提供一体化的金融产品与/或服务，您授权我们在法律及相关规定允许的范围内，从我们的关联方、服务提供方等第三方处接收、存储和处理您的相关个人信息，以改善您的服务体验或者为之赋予个性化。如您拒绝授权，可能无法使用我们的一站式服务，但不影响您使用本网络运营平台的核心功能。\n' +
      '（三）您个人信息使用的规则\n' +
      '1、我们会根据本隐私政策的约定并为实现我们的产品与/或服务功能对所收集的个人信息进行使用。\n' +
      '2、在收集您的个人信息后，我们将通过技术手段对数据进行去标识化处理，去标识化处理的信息将无法识别主体。请您了解并同意，在此情况下我们有权使用已经去标识化的信息；并在不透露您个人信息的前提下，对用户数据库进行分析并予以商业化的利用。\n' +
      '3、根据网络服务实名制管理要求和监管机构相关规定，为保证我们为您提供保服务的连续性、真实性，我们可能需要将您的身份信息、联系信息、财产信息提交给我们委托的第三方对您的个人信息进行核验。\n' +
      '4、我们可在得到您的同意之后，将您的个人信息（无论是线上还是线下提供的）用于不时地将我们的服务、特别活动或推广通知予您，为您处理您在线上所下的任何订单，就您的兴趣偏好及对我们的服务与/产品的意见向您进行市场调研，或者将该信息用于特别通知予您的其他目的。\n' +
      '5、请您注意，您在使用我们的服务时所提供的所有个人信息，除非您删除或通过系统设置拒绝我们收集，否则将在您使用我们的服务期间持续授权我们使用。\n' +
      '6、当我们展示您的个人信息时，我们会采用包括内容替换、匿名处理方式对您的信息进行脱敏，以保护您的信息安全。\n' +
      '7、我们会对我们的服务使用情况进行统计或用于精算研究，并可能会与公众、行业组织、相关监管机构或其他第三方共享这些信息，以展示我们的产品与/或服务的整体使用趋势。但这些信息不包含您的任何身份识别信息。\n' +
      '8、当我们要将您的个人信息用于本政策未载明的其它用途时，或基于特定目的收集而来的信息用于其他目的时，会通过让您主动做出勾选的形式事先征求您的同意。\n' +
      '\n' +
      '二、我们如何使用Cookie和同类技术\n' +
      '（一）Cookie的使用\n' +
      '为确保网站正常运转，我们会在您的计算机或移动设备上存储名为Cookie的小数据文件。Cookie通常包含标识符、站点名称以及一些号码和字符。借助于Cookie，网站能够存储您的偏好或购物篮内的商品等数据。 \n' +
      '我们不会将Cookie用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookie。您可以清除计算机上保存的所有Cookie，大部分网络浏览器都设有阻止Cookie的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置。\n' +
      '（二）网站信标和像素标签的使用\n' +
      '除Cookie外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的点击URL。如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。  \n' +
      '\n' +
      '三、我们如何保护您的个人信息 \n' +
      '我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。\n' +
      '\n' +
      '四、本政策如何更新 \n' +
      '1、我们的隐私政策可能变更。未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。我们会通过包括但不限于弹窗、站内信、公告、邮件、短信等方式及时提示您更新的情况，若您继续使用我们的产品与/或服务，即意味着您同意本隐私政策(含更新版本)内容，并且同意我们按照本隐私政策收集、使用、保存和共享您的相关信息。\n' +
      '    2、对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、短信或在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。\n' +
      '    \n' +
      '五、如何联系我们 \n' +
      '如果您对本隐私政策有任何疑问或任何相关的投诉、意见，请联系客服电话010-87152976。'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  }
})