Page({

    /**
     * 页面的初始数据
     */
    data: {
        title: '邀请规则',
        listBody:
            '1、邀请好友\n' +
            'a)分享本页面给好友\n' +
            'b)好友完成用户注册\n' +
            'c)好友完成实名认证\n' +
            'd)好友推广产品\n' +
            'e)获得好友带来的额外收益\n' +
            '2、邀请奖励\n' +
            'a)好友在本平台上完成实名认证，并推广成功，您享受总出单金额*邀请奖励的比例作为邀请奖励；\n' +
            '3、好友产生的收入如何提现\n' +
            '好友的收入提现和推广产品的收入提现一样。在“个人中心-可提现”中提现。 \n' +
            '4、有关活动问题可通过客服电话010-87152976进行咨询；\n' +
            '5、本活动禁止作弊，一经发现则取消所有奖励，必要时将追究其法律责任；'
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad: function (options) {

    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady: function () {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow: function () {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide: function () {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload: function () {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh: function () {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom: function () {

    },
})
