Page({

  /**
   * 页面的初始数据
   */
  data: {
    title: '提现规则',
    listBody: '1.提现先需完成认实名认证，认证需提交注册人的姓名、身份证和身份证正反面影像件息。\n' +
      '2.每笔订单结算后即可提现。结算时会扣除相应所得税（如需扣税) （根据产品不同结算周期为1 - 23天）\n' +
      '3.提现方式：认证通过后，点击提现按钮，确认需要提现到的银行卡（请保证认证姓名及身份证号和银行卡卡主一致），填写当次提现金额。\n' +
      '4.提现后，工作人员将在3 - 5个工作日左右完成审核并发放提现金额。\n' +
      '5.提现次数及提现手续费: 您每月可免费提现3次，超过3次您需向平台支付2.0元 / 次手续费，该手续费由平台在应向您支付的推广费中自行扣收。\n' +
      '【扣税标准】 \n' +
      '根据《个人所得税法》及《中华人民共和国税收征收管理实施细则》, 本平台需要对代理人收入代扣代缴个人所得税。\n' +
      '代扣代缴个人所得税标准如下: \n' +
      '1）当月收入在800元以下，无需扣除；\n' +
      '2）800元 < 当月收入 <= 4000元；当月税费 = (当月收入 - 800) * 20 %；\n' +
      '3）4000元 < 当月收入 <= 25000元；当月税费 = (当月收入) * (1 - 20 % ) * 20 %；\n' +
      '4） 25000元 < 当月收入 <= 62500元；当月税费 = (当月收入) * (1 - 20 % ) * 30 % -2000；\n' +
      '5）当月收入 > 625000；当月税费 = (当月收入) * (1 - 20 % ) * 40 % -7000；\n' +
      '【推广奖励】 使用小程序发送专属产品链接，由该链接产生的订单将获得相应比例×订单总额的推广奖励。\n' +
      '【邀请奖励】分享自己的注册链接，下级通过该链接注册后，获得该下级所有推广订单相应比例×订单总额的邀请奖励。注：\n' +
      '1) 购买人与推广人一致时无法获得推广奖励；\n' +
      '2) 每款产品的具体奖励见产品展示。\n' +
      '如有问题可通过客服电话010 - 87152976进行咨询。'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },
})