Page({

  /**
   * 页面的初始数据
   */
  data: {
    title: '代理人资质查询授权书',
    listBody: '本人同意对爱保科技（横琴）有限公司(下称“爱保科技”)及其关联公司授权如下:\n' +
      '1.本人同意授权爱保科技及其关联公司根据本人提供的身份证件号码，查询本人的保险从业人员相关执业登记情况。\n' +
      '本人承诺，本人提供的身份证件号码真实，不存在借用、冒用等情况。如因本人违反该承诺而产生的法律责任，由本人承担。\n' +
      '2.本人的保险从业人员相关执业登记情况如发生变更登记、注销登记等情形的，应及时通知爱保科技。\n' +
      '如因本人未及时通知而产生的法律责任，由本人承担。'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  }
})