Page({

  /**
   * 页面的初始数据
   */
  data: {
    title: '本用户协议',
    listBody: '本协议是爱保科技（横琴）有限公司(以下简称“本公司”)与用户(以下简称“您”)就您使用本平台相关服务所订立的协议。\n' +
      '本平台是本公司开发的为保险消费者和保险机构提供网络技术支持辅助服务以及为用户提供其他增值服务的平台。平台的所有权和运营权归本公司所有。\n' +
      '您加入或使用本平台表明您已阅读并同意接受本协议的全部约定内容以及与本协议有关的已经发布或将来可能发布的各项协议、规则、说明、用户须知、页面展示、操作流程、公告或通知（以下统称“规则”）。在接受本协议之前，请您仔细阅读本协议的全部内容。如果您不同意本协议的任意内容、或者无法准确理解该条款的含义，请不要进行后续操作。\n' +
      '\n' +
      '一、会员须知\n' +
      '1.注册者资格\n' +
      '本有权审核并决定是否接受任何单位或个人欲成为会员的申请，并有权要求会员提供任何本认为必要的资料、证书、证明等文件。\n' +
      '若您自愿申请注册成为本平台的会员或使用、接受本平台的服务，您应当是具有完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果。\n' +
      '2.会员信息\n' +
      '在完成注册、激活或验证流程时，您应当按照相应页面的提示提供您的身份信息及资料，以使之真实、及时、完整和准确；您承诺将承担因提供提供身份信息及相关资料不准确、不真实、不及时和不完整而引发的一切责任。\n' +
      '当您的身份信息及资料发生变化时，您应当及时更新并准确提供您的身份信息及资料。\n' +
      '3.账户安全\n' +
      '在您完成注册申请手续后，意味着您获得本账户的使用权，该会员账号和密码由您负责保管，您应当对以会员帐号进行的所有活动和事件负法律责任。\n' +
      '您应妥善保管您的账户（会员名）和密码，通过您的账户（会员名）和密码操作或实施的行为（包括但不限于发布信息、转发、点击同意或提交购买、接受各类产品或服务等），将视为您本人的行为，由您本人承担相应的责任和后果。如果您发现他人不当使用您的账户或有任何其他可能危及您的账户安全的情形时，您应当立即以书面、有效方式通知本，要求本暂停相关服务。在此，您理解本对您的请求采取行动需要合理时间，本对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。\n' +
      '4.账户管理\n' +
      '为了保障您的合法权益，您应确保账户是您本人实名开立并使用。您同意并授权本平台，采取各种必要手段，包括但不限于通过您的第三方支付机构、银行或者我们认可的其他方式对您身份进行验证。除非有法律规定或司法裁判，否则您的登录名和密码不得以任何方式转让、赠予或继承。\n' +
      '5.本仅作为平台，提供相关保险信息、操作服务，不进行保险经营行为。保险投保规则及收费和结算规则均由保险公司确定。投保的保费直接转入保险公司或保险中介机构的保费收入专用账户，本不以任何形式收取保费。\n' +
      '\n' +
      '二、会员的权利义务\n' +
      '1.在遵守本协议的前提下，您将享有本平台提供的会员服务，并将收到本最新的产品信息，活动资讯和平台服务的相关信息及通知。\n' +
      '2.在本协议项下，本公司向您提供以下服务：\n' +
      '（1）查询保险产品、相关资讯等信息；\n' +
      '（2）通过本平台系统与保险机构系统相联实现在线投保服务；\n' +
      '（3）使用本平台提供的链接进行引流时，本平台将依据您完成的服务成果向您支付相应奖励；\n' +
      '（4）其他本公司提供的服务。\n' +
      '3.在线投保：\n' +
      '在线投保服务是指保险机构在本上设置保险机构交易前台，以便于您通过本平台向保险机构申请购买保险。\n' +
      '在线投保服务将采取支付机构作为交易资金渠道。您必须开立支付机构交易账户，才能使用线投保服务。您在本平台上产生的购买保险的指令将通过支付机构处理。您应保证您在支付机构所开立的账户或其他指定账户状态正常，交易款项可正常划转。因前述原因导致交易无法实现的或其他损失的，所有损失由您自行承担，本公司、保险机构不承担任何责任。\n' +
      '4.引流及奖励\n' +
      '您在使用本平台提供的链接进行引流时，本平台将依据您完成的服务成果向您支付相应奖励，并视为您已了解并认可您在进行引流时的规则及政策。\n' +
      '奖励的计算和支付：奖励按照本平台发布并随时更新的奖励方案进行发放。如投保成功后，发生退保行为，本有权扣回该笔保单对应的所有奖励。因奖励产生的任何税金、费用。本依据《中华人民共和国个人所得税法》、《中华人民共和国个人所得税法实施条例》、相关法规及本协议中关于劳务报酬所得的征税规定为您代扣代缴相关税金、费用后向您支付奖励。\n' +
      '5.在本平台上使用服务过程中，您承诺遵守以下约定：\n' +
      '（1）在使用本服务过程中所有行为均遵守国家法律、法规等规范文件，不违背社会公共利益或公共道德，不损害他人合法权益，不违反本服务协议；\n' +
      '（2）在使用本服务过程中，不得进行保险业务的销售、承保、理赔、退保、投诉处理及客户服务等保险经营行为，您应自行承担因违法从事保险经营行为而产生的所有民事、行政、刑事等一切法律责任；\n' +
      '6.本服务涉及互联网及移动通讯等服务，可能会受到各个环节不稳定因素等影响，若由此出现的系统差错、故障或其他原因导致本支出差错等情形的，您同意本平台可以采取更正差错、扣划款项、暂停服务等适当纠正措施。\n' +
      '\n' +
      '三、风险提示及责任免除\n' +
      '1.您知晓并同意，您通过本平台所从事的交易可能面临如下风险，该此风险需由您自行承担。\n' +
      '（1）监管风险：有关法律、法规及相关政策、规则发生变化，导致本公司无法为您提供服务，您由此可能遭受损失。\n' +
      '（2）因您的过错导致的任何损失，该过错包括但不限于：决策失误、操作不当、密码泄漏、密码被他人破解、您使用的计算机系统被第三方侵入。\n' +
      '2.您知晓并同意，本公司仅向您提供保险信息平台服务及网络技术支持辅助服务，本公司并非保险交易等行为的参与方，不对此行为的任一方作任何口头、书面陈述或对保险机构的承诺的真实性、合法性、准确性、完整性做任何明示或暗示的担保，或对此承担任何责任。与保险产品等有关任何理赔、纠纷处理等活动，将由提供保险产品的保险公司、保险中介机构负责，本将提供一定的技术/客服支持。\n' +
      '3.本可能保留有第三方网站或网址的链接，访问这些链接将由用户自己做出决定，本并不就这些连接上所提供的任何信息、数据、观点、图片陈述或建议的准确性、完整性、充分性和可靠性提供承诺或保证。本没有审查过任何第三方网站，对这些网站及其内容不进行控制，也不负任何责任。如果您决定访问任何与本站链接的第三方网站，其可能带来的结果和风险全部由您自己承担。\n' +
      '4.本平台因下列状况无法正常动作，使您无法使用本服务时，本公司不承担任何责任，该状况包括但不限于：\n' +
      '（1）本平台停机维护或升级；\n' +
      '（2）本平台所依赖的电信设备出现故障；\n' +
      '（3）因台风、地震、海啸、洪水、雷电、停电、战争等的影响；\n' +
      '（4）您的电脑软件、系统、硬件或通信线路、供电线路出现故障的；\n' +
      '（5）您操作不当或通过非本公司授权或认可的方式使用本服务；\n' +
      '（6）因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、银行原因、第三方服务瑕疵或政府行为等原因。\n' +
      '其他不可归因于本公司的原因。\n' +
      '\n' +
      '四、赔偿责任\n' +
      '1.您在使用我公司提供的服务的过程中，因发生以下情形而使您或您的客户（投保人）遭受经济损失的，本公司将以您或您的客户（投保人）实际所遭受的经济损失为限进行赔偿。\n' +
      '本公司未能于收到您或您的客户（投保人）提交的投保申请后24小时内向保险机构完整提交您或您的客户（投保人）提供的承保所需的资料信息。\n' +
      '2.发生以下情形的，本公司不对您的客户（投保人）承担任何赔偿责任：\n' +
      '（1）因您或您的客户（投保人）向本公司提交的承保信息有误（包括但不限于提交承保的资料信息错误、遗漏；提交的承保的险种错误、遗漏等）而导致投保人的个别或全部险种未投保成功的；\n' +
      '（2）您或您的客户（投保人）主张本平台未进行完整的信息披露或主张信息披露有误而要求本公司赔偿损失，但该等未披露的信息并不在《互联网保险业务监管暂行办法》规定的应当披露的信息之列的；\n' +
      '（3）您或您的客户（投保人）向本公司隐瞒或虚构您或您的客户（投保人）与保险合同有关的重要情况；您阻碍您的客户履行如实告知义务或诱导、串通您的客户（投保人）不履行如实告知义务；串通投保人、被保险人或受益人骗取保险金；或违反《中华人民共和国保险法》、《保险代理机构监管规定》、《保险经纪人监管规定》等相关法律法规对保险代理人、保险经纪人的行为的规定而给投保人或保险机构造成损失的。\n' +
      '因发生以上情形而使本公司向投保人、保险机构承担赔偿责任或使本公司遭受任何损失、处罚的，本公司有权停止向您提供服务并向您追偿（追偿的方式包括但不限于直接扣收您相应金额的奖励、提起诉讼等）。\n' +
      '\n' +
      '五、知识产权\n' +
      '1.除保险公司或保险中介机构提供的产品及相关展示、说明外，本平台上全部智力成果，包括但不限于数据库、软件、著作、照片、视频、音频及其前述组合，本公司均依法拥有知识产权。\n' +
      '2.未经授权，任何人不得对本平台相关软件进行反向工程、反向编译，不得擅自使用、修改、复制、公开传播本平台上的材料或内容；否则，本公司将保留追究相关主体责任的权利。\n' +
      '\n' +
      '六、法律适用及争议解决\n' +
      '1.本协议的成立、生效、履行和解释，均适用中华人民共和国法律；法律无明文规定的，应适用本公司制定的业务规则和通行的商业惯例。\n' +
      '2.您同意，因履行本协议发生纠纷的，任何一方应向本公司住所地（北京市朝阳区）人民法院提起诉讼。\n' +
      '\n' +
      '七、协议终止\n' +
      '1.您同意遵守有关计算机及互联网规定的相关法律法规之规定。在任何情况下，若本公司合理地认为您的行为可能违反上述法律法规，本公司可在不事先通知您的情况下随时终止向您提供服务。\n' +
      '2.除本协议另有规定外，本公司在提前通知的情况下，可以单方面终止向您提供本协议项下服务而不承担任何赔偿责任。\n' +
      '\n' +
      '八、其他\n' +
      '1.本协议履行过程中，本公司向您发出的书面通知方式包括但不限于邮寄纸质通知、本平台公告、电子邮件、站内信、手机短信等方式。如本公司以邮寄方式向您发出书面通知的，则在按照您在本公司留存的通讯地址交邮后的第三个自然日即视为送达，如以本平台公告，电子邮件、手机短信等电子方式发出书面通告的，则在通知发送成功即视为送达。\n' +
      '2.本公司重视对用户隐私的保护，除本协议约定外，本公司将按照《隐私政策》保护您的身份信息和其他个人信息，详情请参阅《隐私政策》。'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  }
})